<a href="https://colab.research.google.com/github/sufiyanpatel27/practice/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [77]:
import pandas as pd
from sklearn import preprocessing
from sklearn.model_selection import train_test_split

In [78]:
df = pd.read_csv('/content/train.csv')

In [79]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [80]:
df.drop(['PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked'], axis = 1, inplace = True)

In [81]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [82]:
#df['Age'].isnull().sum()
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [83]:
from sklearn.preprocessing import LabelEncoder

scaler = LabelEncoder()

a = scaler.fit_transform(df['Sex'])

df['Sex'] = a

df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    1  22.0      1      0   7.2500
1         1       1    0  38.0      1      0  71.2833
2         1       3    0  26.0      0      0   7.9250
3         1       1    0  35.0      1      0  53.1000
4         0       3    1  35.0      0      0   8.0500

In [84]:
from sklearn.preprocessing import MinMaxScaler

scaler_minmax = MinMaxScaler()

a = scaler_minmax.fit_transform(df[['Age']])
b = scaler_minmax.fit_transform(df[['Fare']])

df['Age'] = a
df['Fare'] = b

df.head()

   Survived  Pclass  Sex       Age  SibSp  Parch      Fare
0         0       3    1  0.271174      1      0  0.014151
1         1       1    0  0.472229      1      0  0.139136
2         1       3    0  0.321438      0      0  0.015469
3         1       1    0  0.434531      1      0  0.103644
4         0       3    1  0.434531      0      0  0.015713

In [85]:
X = df.loc[:, df.columns != 'Survived']
y = df.loc[:, df.columns == 'Survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=.2)

from sklearn.svm import SVC
classifier = SVC(kernel='linear', random_state=0)
classifier.fit(X_train, y_train)

train_accuracy = classifier.score(X_train, y_train)
test_accuracy = classifier.score(X_test, y_test)

print(train_accuracy, test_accuracy)

0.7879213483146067 0.7821229050279329

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)